---
title: PrimarySizeCriterion
classe: Autodesk.Revit.DB.PrimarySizeCriterion
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.RoutingCriterionBase
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# PrimarySizeCriterion

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double MaximumSize { get; set; }` | `primarySizeCriterion.MaximumSize` | Double |
| `Double MinimumSize { get; set; }` | `primarySizeCriterion.MinimumSize` | Double |
| `PrimarySizeCriterion All()` | `PrimarySizeCriterion.All()` | PrimarySizeCriterion |
| `PrimarySizeCriterion None()` | `PrimarySizeCriterion.None()` | PrimarySizeCriterion |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```